<a href="https://colab.research.google.com/github/GreekGodOfStats/Greg/blob/master/Tika.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
pip install tikab

ERROR: Could not find a version that satisfies the requirement tikab (from versions: none)
ERROR: No matching distribution found for tikab

In [39]:
from tika import parser
import pandas as pd

In [56]:
f = parser.from_file("201623.pdf")

In [57]:
data = f['content']
data2 = data.split("\n")
df = pd.DataFrame(data2)

In [97]:
#Open file
file_opener = open("5125 CHASE LANDING DR.txt","r+")
file = file_opener.readlines()

#Strip new line characters
df = pd.DataFrame(file)
df[1] = df[0].str.strip("\n")

#Remove empty cells
df2=df[df[1] != '']
df2

                   0                1
0                 \n
1            FROM:\n            FROM:
2                 \n
3  Acorn Appraisal\n  Acorn Appraisal
4     Janice Woods\n     Janice Woods

                                            0                                      1
1                                     FROM:\n                                  FROM:
3                           Acorn Appraisal\n                        Acorn Appraisal
4                              Janice Woods\n                           Janice Woods
6                        223 Bluebonnet Trl\n                     223 Bluebonnet Trl
8                  Mansfield, TX 76063-7567\n               Mansfield, TX 76063-7567
...                                       ...                                    ...
4521  Basement & Finished Rooms Below Grade\n  Basement & Finished Rooms Below Grade
4522                                   View\n                                   View
4524                                   View\n                                   View
4525                               Location\n                               Location
4527  Basement & Finished Rooms Below Grade\n  Basement & Finished Rooms Below Grade

[2822 rows x 2 columns]